# ЭТАП 1: Сборка приложения
# Берем официальный образ Maven с Java 21, чтобы скомпилировать проект
FROM maven:3.9.9-eclipse-temurin-21 AS build

# Создаем рабочую папку внутри контейнера
WORKDIR /app

# Копируем файл зависимостей
COPY pom.xml .

# Скачиваем зависимости (они сохранятся в кэше Docker)
RUN mvn dependency:go-offline -B

# Теперь копируем исходный код нашего проекта
COPY src ./src

# Запускаем сборку .jar файла (пропуская тесты для скорости)
RUN mvn clean package -DskipTests

# -------------------------------------------------------------

# ЭТАП 2: Запуск готового приложения
# Нам больше не нужен тяжелый Maven. Берем только легкую Java 21
FROM eclipse-temurin:21-jre-alpine

WORKDIR /app

# Забираем готовый .jar файл из ЭТАПА 1
COPY --from=build /app/target/*.jar app.jar

# Говорим Docker, что наше приложение слушает порт 8080
EXPOSE 8080

# Главная команда, которая запустит приложение при старте контейнера
ENTRYPOINT ["java", "-jar", "app.jar"]